{
    "cells": [
        {
            "cell_type": "code",
            "execution_count": 26,
            "id": "9172390d",
            "metadata": {},
            "outputs": [
                {
                    "data": {
                        "text/plain": [
                            "<kuzu.query_result.QueryResult at 0x169e12110>"
                        ]
                    },
                    "execution_count": 26,
                    "metadata": {},
                    "output_type": "execute_result"
                }
            ],
            "source": [
                "import kuzu;\n",
                "db = kuzu.Database(\"db\")\n",
                "conn = kuzu.Connection(db)\n",
                "conn.execute(\"INSTALL sqlite\")\n",
                " \n",
                "conn.execute(\"LOAD sqlite\")\n",
                "conn.execute(\"ATTACH './raw_data/ayah.sqlite' as ayah (dbtype sqlite)\")"
            ]
        },
        {
            "cell_type": "code",
            "execution_count": 27,
            "id": "55ce8a68",
            "metadata": {},
            "outputs": [
                {
                    "name": "stdout",
                    "output_type": "stream",
                    "text": [
                        "        id  surah_number  ayah_number verse_key  \\\n",
                        "0     2049            17           20     17:20   \n",
                        "1     2050            17           21     17:21   \n",
                        "2     2051            17           22     17:22   \n",
                        "3     2052            17           23     17:23   \n",
                        "4     2053            17           24     17:24   \n",
                        "...    ...           ...          ...       ...   \n",
                        "6231  6232           114            2     114:2   \n",
                        "6232  6233           114            3     114:3   \n",
                        "6233  6234           114            4     114:4   \n",
                        "6234  6235           114            5     114:5   \n",
                        "6235  6236           114            6     114:6   \n",
                        "\n",
                        "                                                   text  \n",
                        "0     كُلّٗا نُّمِدُّ هَٰٓؤُلَآءِ وَهَٰٓؤُلَآءِ مِ...  \n",
                        "1     ٱنظُرۡ كَيۡفَ فَضَّلۡنَا بَعۡضَهُمۡ عَلَىٰ بَع...  \n",
                        "2     لَّا تَجۡعَلۡ مَعَ ٱللَّهِ إِلَٰهًا ءَاخَرَ فَ...  \n",
                        "3     ۞ وَقَضَىٰ رَبُّكَ أَلَّا تَعۡبُدُوٓاْ إِلَّآ...  \n",
                        "4     وَٱخۡفِضۡ لَهُمَا جَنَاحَ ٱلذُّلِّ مِنَ ٱلرَّح...  \n",
                        "...                                                 ...  \n",
                        "6231                                  مَلِكِ ٱلنَّاسِ ٢  \n",
                        "6232                                 إِلَٰهِ ٱلنَّاسِ ٣  \n",
                        "6233               مِن شَرِّ ٱلۡوَسۡوَاسِ ٱلۡخَنَّاسِ ٤  \n",
                        "6234          ٱلَّذِي يُوَسۡوِسُ فِي صُدُورِ ٱلنَّاسِ ٥  \n",
                        "6235                       مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ ٦  \n",
                        "\n",
                        "[6236 rows x 5 columns]\n"
                    ]
                }
            ],
            "source": [
                "response = conn.execute(\"LOAD FROM ayah.verses RETURN *\")\n",
                "print(response.get_as_df())"
            ]
        },
        {
            "cell_type": "code",
            "execution_count": 28,
            "id": "7cf1f0c6",
            "metadata": {},
            "outputs": [
                {
                    "ename": "RuntimeError",
                    "evalue": "Binder exception: Verse already exists in catalog.",
                    "output_type": "error",
                    "traceback": [
                        "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
                        "\u001b[0;31mRuntimeError\u001b[0m                              Traceback (most recent call last)",
                        "Cell \u001b[0;32mIn[28], line 1\u001b[0m\n\u001b[0;32m----> 1\u001b[0m \u001b[43mconn\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mexecute\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;124;43m\"\"\"\u001b[39;49m\n\u001b[1;32m      2\u001b[0m \u001b[38;5;124;43mCREATE NODE TABLE Verse (\u001b[39;49m\n\u001b[1;32m      3\u001b[0m \u001b[38;5;124;43m    id INT64,\u001b[39;49m\n\u001b[1;32m      4\u001b[0m \u001b[38;5;124;43m    surah_number INT64,\u001b[39;49m\n\u001b[1;32m      5\u001b[0m \u001b[38;5;124;43m    ayah_number INT64,\u001b[39;49m\n\u001b[1;32m      6\u001b[0m \u001b[38;5;124;43m    verse_key STRING PRIMARY KEY,\u001b[39;49m\n\u001b[1;32m      7\u001b[0m \u001b[38;5;124;43m    text STRING)\u001b[39;49m\n\u001b[1;32m      8\u001b[0m \u001b[38;5;124;43m\"\"\"\u001b[39;49m\u001b[43m)\u001b[49m\n",
                        "File \u001b[0;32m~/.pyenv/versions/3.11.7/lib/python3.11/site-packages/kuzu/connection.py:130\u001b[0m, in \u001b[0;36mConnection.execute\u001b[0;34m(self, query, parameters)\u001b[0m\n\u001b[1;32m    127\u001b[0m     \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;167;01mRuntimeError\u001b[39;00m(msg)  \u001b[38;5;66;03m# noqa: TRY004\u001b[39;00m\n\u001b[1;32m    129\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mlen\u001b[39m(parameters) \u001b[38;5;241m==\u001b[39m \u001b[38;5;241m0\u001b[39m \u001b[38;5;129;01mand\u001b[39;00m \u001b[38;5;28misinstance\u001b[39m(query, \u001b[38;5;28mstr\u001b[39m):\n\u001b[0;32m--> 130\u001b[0m     _query_result \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_connection\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mquery\u001b[49m\u001b[43m(\u001b[49m\u001b[43mquery\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m    131\u001b[0m \u001b[38;5;28;01melse\u001b[39;00m:\n\u001b[1;32m    132\u001b[0m     prepared_statement \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mprepare(query) \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28misinstance\u001b[39m(query, \u001b[38;5;28mstr\u001b[39m) \u001b[38;5;28;01melse\u001b[39;00m query\n",
                        "\u001b[0;31mRuntimeError\u001b[0m: Binder exception: Verse already exists in catalog."
                    ]
                }
            ],
            "source": [
                "conn.execute(\"\"\"\n",
                "CREATE NODE TABLE Verse (\n",
                "    id INT64,\n",
                "    surah_number INT64,\n",
                "    ayah_number INT64,\n",
                "    verse_key STRING PRIMARY KEY,\n",
                "    text STRING)\n",
                "\"\"\")"
            ]
        },
        {
            "cell_type": "code",
            "execution_count": null,
            "id": "11c07ef4",
            "metadata": {},
            "outputs": [
                {
                    "data": {
                        "text/plain": [
                            "<kuzu.query_result.QueryResult at 0x127501a50>"
                        ]
                    },
                    "execution_count": 8,
                    "metadata": {},
                    "output_type": "execute_result"
                }
            ],
            "source": [
                "conn.execute(\"COPY Verse from ayah.verses\")"
            ]
        },
        {
            "cell_type": "code",
            "execution_count": null,
            "id": "99d897da",
            "metadata": {},
            "outputs": [
                {
                    "name": "stdout",
                    "output_type": "stream",
                    "text": [
                        "      v.id  v.surah_number  v.ayah_number v.verse_key  \\\n",
                        "0     6145              99              7        99:7   \n",
                        "1     6146              99              8        99:8   \n",
                        "2     6147             100              1       100:1   \n",
                        "3     6148             100              2       100:2   \n",
                        "4     6149             100              3       100:3   \n",
                        "...    ...             ...            ...         ...   \n",
                        "6231  4092              39             34       39:34   \n",
                        "6232  4093              39             35       39:35   \n",
                        "6233  4094              39             36       39:36   \n",
                        "6234  4095              39             37       39:37   \n",
                        "6235  4096              39             38       39:38   \n",
                        "\n",
                        "                                                 v.text  \n",
                        "0     فَمَن يَعۡمَلۡ مِثۡقَالَ ذَرَّةٍ خَيۡرٗا يَرَه...  \n",
                        "1     وَمَن يَعۡمَلۡ مِثۡقَالَ ذَرَّةٖ شَرّٗا يَرَهُۥ ٨  \n",
                        "2                             وَٱلۡعَٰدِيَٰتِ ضَبۡحٗا ١  \n",
                        "3                             فَٱلۡمُورِيَٰتِ قَدۡحٗا ٢  \n",
                        "4                             فَٱلۡمُغِيرَٰتِ صُبۡحٗا ٣  \n",
                        "...                                                 ...  \n",
                        "6231  لَهُم مَّا يَشَآءُونَ عِندَ رَبِّهِمۡۚ ذَٰلِك...  \n",
                        "6232  لِيُكَفِّرَ ٱللَّهُ عَنۡهُمۡ أَسۡوَأَ ٱلَّذِي ...  \n",
                        "6233  أَلَيۡسَ ٱللَّهُ بِكَافٍ عَبۡدَهُۥۖ وَيُخَوِّف...  \n",
                        "6234  وَمَن يَهۡدِ ٱللَّهُ فَمَا لَهُۥ مِن مُّضِلٍّۗ...  \n",
                        "6235  وَلَئِن سَأَلۡتَهُم مَّنۡ خَلَقَ ٱلسَّمَٰوَٰتِ...  \n",
                        "\n",
                        "[6236 rows x 5 columns]\n"
                    ]
                }
            ],
            "source": [
                "result = conn.execute(\"MATCH (v:Verse) RETURN v.*\")\n",
                "print(result.get_as_df())"
            ]
        },
        {
            "cell_type": "code",
            "execution_count": 33,
            "id": "4f74ca42",
            "metadata": {},
            "outputs": [
                {
                    "data": {
                        "text/plain": [
                            "<kuzu.query_result.QueryResult at 0x104622f90>"
                        ]
                    },
                    "execution_count": 33,
                    "metadata": {},
                    "output_type": "execute_result"
                }
            ],
            "source": [
                "conn.execute(\"ATTACH 'raw_data/topics.sqlite' AS topics (dbtype sqlite)\")"
            ]
        },
        {
            "cell_type": "code",
            "execution_count": null,
            "id": "bb14712b",
            "metadata": {
                "vscode": {
                    "languageId": "sql"
                }
            },
            "outputs": [
                {
                    "data": {
                        "text/plain": [
                            "<kuzu.query_result.QueryResult at 0x169ee23d0>"
                        ]
                    },
                    "execution_count": 19,
                    "metadata": {},
                    "output_type": "execute_result"
                }
            ],
            "source": [
                "conn.execute(\"\"\"\n",
                "CREATE NODE TABLE Topic (\n",
                "    topic_id INT64 PRIMARY KEY,\n",
                "    name STRING,\n",
                "    arabic_name STRING,\n",
                "    parent_id INT64,\n",
                "    thematic_parent_id INT64,\n",
                "    ontology_parent_id INT64,\n",
                "    description STRING,\n",
                "    wiki_link STRING,\n",
                "    thematic INT64,\n",
                "    ontology INT64,\n",
                "    ayahs STRING,\n",
                "    related_topics STRING\n",
                ")\n",
                "\"\"\")\n",
                "\n",
                "conn.execute(\"\"\"\n",
                "CREATE REL TABLE HAS_TOPIC (\n",
                "    FROM Verse TO Topic\n",
                ")\n",
                "\"\"\")\n",
                "\n",
                "conn.execute(\"\"\"\n",
                "CREATE REL TABLE PARENT_TOPIC (\n",
                "    FROM Topic TO Topic\n",
                ")\n",
                "\"\"\")"
            ]
        },
        {
            "cell_type": "code",
            "execution_count": null,
            "id": "3691f5c3",
            "metadata": {},
            "outputs": [
                {
                    "name": "stdout",
                    "output_type": "stream",
                    "text": [
                        "      topic_id                                name   arabic_name  parent_id  \\\n",
                        "0            1                               Allah          الله        NaN   \n",
                        "1            2                 Day of Resurrection   يوم القيامة        NaN   \n",
                        "2            3                               Heart           قلب        NaN   \n",
                        "3            4                            Last Day  اليوم الآخر        NaN   \n",
                        "4            5                               Earth           أرض        NaN   \n",
                        "...        ...                                 ...           ...        ...   \n",
                        "2507      2508                     false testimony           NaN        NaN   \n",
                        "2508      2509                               magic           NaN        NaN   \n",
                        "2509      2510                Doors to forgiveness           NaN        NaN   \n",
                        "2510      2511                           wide open           NaN        NaN   \n",
                        "2511      2512  evil deeds changed into good deeds           NaN        NaN   \n",
                        "\n",
                        "      thematic_parent_id  ontology_parent_id  \\\n",
                        "0                 1837.0                 NaN   \n",
                        "1                    NaN               251.0   \n",
                        "2                    NaN               263.0   \n",
                        "3                    NaN               251.0   \n",
                        "4                    NaN               249.0   \n",
                        "...                  ...                 ...   \n",
                        "2507              2491.0                 NaN   \n",
                        "2508              2491.0                 NaN   \n",
                        "2509              2481.0                 NaN   \n",
                        "2510              2510.0                 NaN   \n",
                        "2511              2510.0                 NaN   \n",
                        "\n",
                        "                                            description  \\\n",
                        "0     <b>Allah</b> (<span class=\"ar\">الله</span>) is...   \n",
                        "1     <b>Day of Resurrection</b> (<span class=\"ar\">ي...   \n",
                        "2     <b>Heart</b> (<span class=\"ar\">قلب</span>) is ...   \n",
                        "3     <b>Last Day</b> (<span class=\"ar\">اليوم الآخر...   \n",
                        "4     <b>Earth</b> (<span class=\"ar\">أرض</span>) is ...   \n",
                        "...                                                 ...   \n",
                        "2507                                                NaN   \n",
                        "2508                                                NaN   \n",
                        "2509                                                NaN   \n",
                        "2510                                                NaN   \n",
                        "2511                                                NaN   \n",
                        "\n",
                        "                                              wiki_link  thematic  ontology  \\\n",
                        "0                          en.wikipedia.org//wiki/Allah         1         1   \n",
                        "1     en.wikipedia.org//wiki/Islamic_view_of_the_Las...         0         1   \n",
                        "2                          en.wikipedia.org//wiki/Heart         0         1   \n",
                        "3     en.wikipedia.org//wiki/Islamic_view_of_the_Las...         0         1   \n",
                        "4                          en.wikipedia.org//wiki/Earth         0         1   \n",
                        "...                                                 ...       ...       ...   \n",
                        "2507                                                NaN         1         0   \n",
                        "2508                                                NaN         1         0   \n",
                        "2509                                                NaN         1         0   \n",
                        "2510                                                NaN         1         0   \n",
                        "2511                                                NaN         1         0   \n",
                        "\n",
                        "                                                  ayahs related_topics  \n",
                        "0     1:1, 1:2, 1:5, 1:6, 1:7, 2:7, 2:8, 2:9, 2:10, ...                 \n",
                        "1     1:4, 2:85, 2:113, 2:174, 2:212, 3:55, 3:77, 3:...                 \n",
                        "2     2:7, 2:10, 2:74, 2:88, 2:93, 2:97, 2:118, 2:20...                 \n",
                        "3     2:8, 2:62, 2:126, 2:177, 2:228, 2:232, 2:264, ...                 \n",
                        "4     2:11, 2:22, 2:27, 2:29, 2:30, 2:33, 2:36, 2:60...                 \n",
                        "...                                                 ...            ...  \n",
                        "2507                                              22:30                 \n",
                        "2508                                              2:102                 \n",
                        "2509                                                                    \n",
                        "2510                                              4:110                 \n",
                        "2511                         25:68, 25:69, 25:70, 25:71                 \n",
                        "\n",
                        "[2512 rows x 12 columns]\n"
                    ]
                }
            ],
            "source": [
                "topics_response = conn.execute(\"LOAD FROM topics.topics RETURN *;\")\n",
                "print(topics_response.get_as_df())"
            ]
        },
        {
            "cell_type": "code",
            "execution_count": null,
            "id": "84d58c65",
            "metadata": {},
            "outputs": [
                {
                    "data": {
                        "text/plain": [
                            "<kuzu.query_result.QueryResult at 0x169e3c210>"
                        ]
                    },
                    "execution_count": 25,
                    "metadata": {},
                    "output_type": "execute_result"
                }
            ],
            "source": [
                "# conn.execute(\"DROP TABLE HAS_TOPIC\");\n",
                "# conn.execute(\"DROP TABLE Topic\");\n",
                "\n",
                "# conn.execute(\"\"\"\n",
                "# CREATE REL TABLE Transfer(\n",
                "#     FROM Verse TO Verse,\n",
                "#     amount INT\n",
                "# )\n",
                "# \"\"\")\n",
                "\n",
                "# conn.execute(\"DROP TABLE Transfer\")"
            ]
        },
        {
            "cell_type": "code",
            "execution_count": 35,
            "id": "737c81d3",
            "metadata": {},
            "outputs": [
                {
                    "ename": "RuntimeError",
                    "evalue": "Copy exception: Found duplicated primary key value 2255, which violates the uniqueness constraint of the primary key column.",
                    "output_type": "error",
                    "traceback": [
                        "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
                        "\u001b[0;31mRuntimeError\u001b[0m                              Traceback (most recent call last)",
                        "Cell \u001b[0;32mIn[35], line 1\u001b[0m\n\u001b[0;32m----> 1\u001b[0m \u001b[43mconn\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mexecute\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mCOPY Topic FROM topics.topics\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m)\u001b[49m\n",
                        "File \u001b[0;32m~/.pyenv/versions/3.11.7/lib/python3.11/site-packages/kuzu/connection.py:130\u001b[0m, in \u001b[0;36mConnection.execute\u001b[0;34m(self, query, parameters)\u001b[0m\n\u001b[1;32m    127\u001b[0m     \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;167;01mRuntimeError\u001b[39;00m(msg)  \u001b[38;5;66;03m# noqa: TRY004\u001b[39;00m\n\u001b[1;32m    129\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mlen\u001b[39m(parameters) \u001b[38;5;241m==\u001b[39m \u001b[38;5;241m0\u001b[39m \u001b[38;5;129;01mand\u001b[39;00m \u001b[38;5;28misinstance\u001b[39m(query, \u001b[38;5;28mstr\u001b[39m):\n\u001b[0;32m--> 130\u001b[0m     _query_result \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_connection\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mquery\u001b[49m\u001b[43m(\u001b[49m\u001b[43mquery\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m    131\u001b[0m \u001b[38;5;28;01melse\u001b[39;00m:\n\u001b[1;32m    132\u001b[0m     prepared_statement \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mprepare(query) \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28misinstance\u001b[39m(query, \u001b[38;5;28mstr\u001b[39m) \u001b[38;5;28;01melse\u001b[39;00m query\n",
                        "\u001b[0;31mRuntimeError\u001b[0m: Copy exception: Found duplicated primary key value 2255, which violates the uniqueness constraint of the primary key column."
                    ]
                }
            ],
            "source": [
                "conn.execute(\"COPY Topic FROM topics.topics\")\n",
                "\n"
            ]
        },
        {
            "cell_type": "code",
            "execution_count": 31,
            "id": "fdcca0a5",
            "metadata": {},
            "outputs": [
                {
                    "name": "stdout",
                    "output_type": "stream",
                    "text": [
                        "Created 732 regular parent relationships.\n"
                    ]
                }
            ],
            "source": [
                "parent_result = conn.execute(\"\"\"\n",
                "MATCH (child:Topic), (parent:Topic)\n",
                "WHERE child.parent_id = parent.topic_id\n",
                "CREATE (child)-[:PARENT_TOPIC]->(parent)\n",
                "RETURN count(*) AS parent_relationships\n",
                "\"\"\")\n",
                "print(f\"Created {parent_result.get_as_df().iloc[0]['parent_relationships']} regular parent relationships.\")\n"
            ]
        },
        {
            "cell_type": "code",
            "execution_count": 37,
            "id": "3326cfa7",
            "metadata": {},
            "outputs": [
                {
                    "data": {
                        "text/plain": [
                            "<kuzu.query_result.QueryResult at 0x1697fb5d0>"
                        ]
                    },
                    "execution_count": 37,
                    "metadata": {},
                    "output_type": "execute_result"
                }
            ],
            "source": [
                "conn.execute(\"MATCH ()-[p:PARENT_TOPIC]->() DELETE p\")"
            ]
        },
        {
            "cell_type": "markdown",
            "id": "topic-parent-md",
            "metadata": {},
            "source": [
                "## Step 2: Create Topic-Topic Relationships\n",
                "\n",
                "Now, let's create parent-child relationships between topics based on the parent_id fields."
            ]
        },
        {
            "cell_type": "code",
            "execution_count": null,
            "id": "topic-parent-code",
            "metadata": {},
            "outputs": [],
            "source": [
                "# Create parent-child relationships based on parent_id\n",
                "parent_result = conn.execute(\"\"\"\n",
                "MATCH (child:Topic), (parent:Topic)\n",
                "WHERE child.parent_id = parent.topic_id\n",
                "CREATE (child)-[:PARENT_TOPIC]->(parent)\n",
                "RETURN count(*) AS parent_relationships\n",
                "\"\"\")\n",
                "print(f\"Created {parent_result.get_as_df().iloc[0]['parent_relationships']} regular parent relationships.\")\n",
                "\n",
                "# Create thematic parent relationships\n",
                "thematic_result = conn.execute(\"\"\"\n",
                "MATCH (child:Topic), (parent:Topic)\n",
                "WHERE child.thematic_parent_id = parent.topic_id\n",
                "CREATE (child)-[:PARENT_TOPIC {type: 'thematic'}]->(parent)\n",
                "RETURN count(*) AS thematic_parent_relationships\n",
                "\"\"\")\n",
                "print(f\"Created {thematic_result.get_as_df().iloc[0]['thematic_parent_relationships']} thematic parent relationships.\")\n",
                "\n",
                "# Create ontology parent relationships\n",
                "ontology_result = conn.execute(\"\"\"\n",
                "MATCH (child:Topic), (parent:Topic)\n",
                "WHERE child.ontology_parent_id = parent.topic_id\n",
                "CREATE (child)-[:PARENT_TOPIC {type: 'ontology'}]->(parent)\n",
                "RETURN count(*) AS ontology_parent_relationships\n",
                "\"\"\")\n",
                "print(f\"Created {ontology_result.get_as_df().iloc[0]['ontology_parent_relationships']} ontology parent relationships.\")\n",
                "\n",
                "# Count all parent-child relationships\n",
                "total_result = conn.execute(\"MATCH ()-[r:PARENT_TOPIC]->() RETURN count(r) AS total_relationships\")\n",
                "print(f\"Total: {total_result.get_as_df().iloc[0]['total_relationships']} parent-child relationships between topics.\")"
            ]
        },
        {
            "cell_type": "markdown",
            "id": "verse-topic-md",
            "metadata": {},
            "source": [
                "## Step 3: Create Verse-Topic Relationships\n",
                "\n",
                "Now, let's parse the ayahs field and create relationships between verses and topics."
            ]
        },
        {
            "cell_type": "code",
            "execution_count": null,
            "id": "verse-topic-code",
            "metadata": {},
            "outputs": [],
            "source": [
                "import pandas as pd\n",
                "import time\n",
                "\n",
                "# Get all topics with their ayahs field\n",
                "topics_df = conn.execute(\"MATCH (t:Topic) RETURN t.topic_id, t.name, t.ayahs\").get_as_df()\n",
                "\n",
                "# Initialize counter for total relationships\n",
                "total_relationships = 0\n",
                "start_time = time.time()\n",
                "\n",
                "# More efficient approach: process topics in batches\n",
                "batch_size = 50  # Process 50 topics at a time\n",
                "num_topics = len(topics_df)\n",
                "num_batches = (num_topics + batch_size - 1) // batch_size  # Ceiling division\n",
                "\n",
                "print(f\"Processing {num_topics} topics in {num_batches} batches...\")\n",
                "\n",
                "for batch_idx in range(num_batches):\n",
                "    start_idx = batch_idx * batch_size\n",
                "    end_idx = min(start_idx + batch_size, num_topics)\n",
                "    batch = topics_df.iloc[start_idx:end_idx]\n",
                "    \n",
                "    print(f\"Processing batch {batch_idx + 1}/{num_batches} (topics {start_idx}-{end_idx-1})...\")\n",
                "    batch_start_time = time.time()\n",
                "    \n",
                "    for _, row in batch.iterrows():\n",
                "        topic_id = row['t.topic_id']\n",
                "        topic_name = row['t.name']\n",
                "        ayahs_str = row['t.ayahs']\n",
                "        \n",
                "        # Skip if ayahs is empty or NaN\n",
                "        if pd.isna(ayahs_str) or not ayahs_str.strip():\n",
                "            continue\n",
                "        \n",
                "        # Split the ayahs string by comma and clean up whitespace\n",
                "        verse_keys = [key.strip() for key in ayahs_str.split(',') if key.strip()]\n",
                "        \n",
                "        if not verse_keys:  # Skip if no valid verse keys\n",
                "            continue\n",
                "            \n",
                "        # Create relationships for all verse keys in one query (more efficient)\n",
                "        verse_keys_str = str(verse_keys).replace(\"'\", \"\\\"\")\n",
                "        \n",
                "        query = f\"\"\"\n",
                "        MATCH (t:Topic), (v:Verse)\n",
                "        WHERE t.topic_id = {topic_id} AND v.verse_key IN {verse_keys_str}\n",
                "        CREATE (v)-[:HAS_TOPIC]->(t)\n",
                "        RETURN count(*) AS relationships_created\n",
                "        \"\"\"\n",
                "        \n",
                "        result = conn.execute(query)\n",
                "        relationships_created = result.get_as_df().iloc[0]['relationships_created']\n",
                "        total_relationships += relationships_created\n",
                "    \n",
                "    batch_time = time.time() - batch_start_time\n",
                "    print(f\"  Batch completed in {batch_time:.2f} seconds\")\n",
                "\n",
                "total_time = time.time() - start_time\n",
                "print(f\"Created {total_relationships} verse-topic relationships in {total_time:.2f} seconds.\")"
            ]
        },
        {
            "cell_type": "markdown",
            "id": "verification-md",
            "metadata": {},
            "source": [
                "## Step 4: Verify the Graph\n",
                "\n",
                "Let's verify that our graph has been properly constructed by running some example queries."
            ]
        },
        {
            "cell_type": "code",
            "execution_count": null,
            "id": "verification-code",
            "metadata": {},
            "outputs": [],
            "source": [
                "# Count the number of nodes and relationships\n",
                "print(\"Graph Statistics:\")\n",
                "verse_count = conn.execute(\"MATCH (v:Verse) RETURN count(v) AS count\").get_as_df().iloc[0]['count']\n",
                "topic_count = conn.execute(\"MATCH (t:Topic) RETURN count(t) AS count\").get_as_df().iloc[0]['count']\n",
                "has_topic_count = conn.execute(\"MATCH ()-[r:HAS_TOPIC]->() RETURN count(r) AS count\").get_as_df().iloc[0]['count']\n",
                "parent_topic_count = conn.execute(\"MATCH ()-[r:PARENT_TOPIC]->() RETURN count(r) AS count\").get_as_df().iloc[0]['count']\n",
                "\n",
                "print(f\"Verses: {verse_count}\")\n",
                "print(f\"Topics: {topic_count}\")\n",
                "print(f\"HAS_TOPIC relationships: {has_topic_count}\")\n",
                "print(f\"PARENT_TOPIC relationships: {parent_topic_count}\")\n",
                "\n",
                "# Example query 1: Find verses related to a specific topic\n",
                "print(\"\n",
                "Example 1: Verses about 'Patience'\")\n",
                "result = conn.execute(\"\"\"\n",
                "MATCH (v:Verse)-[:HAS_TOPIC]->(t:Topic)\n",
                "WHERE t.name = 'Patience'\n",
                "RETURN v.verse_key, v.text\n",
                "LIMIT 5\n",
                "\"\"\")\n",
                "print(result.get_as_df())\n",
                "\n",
                "# Example query 2: Find topics related to a specific verse\n",
                "print(\"\n",
                "Example 2: Topics for verse 2:255 (Ayatul Kursi)\")\n",
                "result = conn.execute(\"\"\"\n",
                "MATCH (v:Verse)-[:HAS_TOPIC]->(t:Topic)\n",
                "WHERE v.verse_key = '2:255'\n",
                "RETURN t.name, t.description\n",
                "\"\"\")\n",
                "print(result.get_as_df())\n",
                "\n",
                "# Example query 3: Find subtopics of a main topic\n",
                "print(\"\n",
                "Example 3: Subtopics of 'Allah'\")\n",
                "result = conn.execute(\"\"\"\n",
                "MATCH (child:Topic)-[:PARENT_TOPIC]->(parent:Topic)\n",
                "WHERE parent.name = 'Allah'\n",
                "RETURN child.name\n",
                "LIMIT 10\n",
                "\"\"\")\n",
                "\n",
                "\n",
                "print(result.get_as_df())\n"
            ]
        }
    ],
    "metadata": {
        "kernelspec": {
            "display_name": "Python 3",
            "language": "python",
            "name": "python3"
        },
        "language_info": {
            "codemirror_mode": {
                "name": "ipython",
                "version": 3
            },
            "file_extension": ".py",
            "mimetype": "text/x-python",
            "name": "python",
            "nbconvert_exporter": "python",
            "pygments_lexer": "ipython3",
            "version": "3.11.7"
        }
    },
    "nbformat": 4,
    "nbformat_minor": 5
}
